tap "felixkratz/formulae"
tap "nikitabobko/tap"

# --- Core CLI / shell ---
brew "stow"
brew "gh"
brew "neovim"
brew "tmux"
brew "lazygit"
brew "fzf"
brew "ripgrep"
brew "direnv"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"

# --- Status bar ---
brew "sketchybar"

# --- Kept extras ---
brew "helm"

# --- Casks ---
cask "aerospace"
cask "codex"
cask "gcloud-cli"
cask "warp"

# --- Fonts ---
cask "font-sketchybar-app-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Note: not installed by brew (handled in bootstrap.sh):
#   nvm + node, rustup, pnpm (corepack), Claude Code (native installer),
#   @google/gemini-cli (npm global on default node),
#   vercel (pnpm global on default node)
